In [1]:
print("Mi Corazon")

Mi Corazon

In [2]:
a = 5
b = 16
sum = a + b

In [3]:
print(sum)

21

In [12]:
user = int(input("Write a number"))
print(user*user*user)

Write a number5
125

In [1]:
import pandas as pd

In [ ]:
# Series is a one-dimensional labeled array

In [2]:
num = [1,2,3,4,5,6,]
pd.Series(num)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [ ]:
# Series using dictionary

In [3]:
dict = {1: "Eniola", 2: "Timileyin", 3: "Damilola", 4: "Ruth", 5: "Favour"}
pd.Series(dict)

1       Eniola
2    Timileyin
3     Damilola
4         Ruth
5       Favour
dtype: object

In [ ]:
# DataFrame - Two dimensional table, made up of collection of series

In [4]:
data = [
    ["Eniola", "OAU", "400L"], ["Timileyin", "OAUSTEC", "400L"],["Damilola", "EKSU", "400L"], ["Favour", "NAO", "400L"]
]

pd.DataFrame(data)

           0        1     2
0     Eniola      OAU  400L
1  Timileyin  OAUSTEC  400L
2   Damilola     EKSU  400L
3     Favour      NAO  400L

In [5]:
pd.DataFrame(data, columns=["Name", "School", "Level"], index = [1,2,3,4])

        Name   School Level
1     Eniola      OAU  400L
2  Timileyin  OAUSTEC  400L
3   Damilola     EKSU  400L
4     Favour      NAO  400L

In [10]:
# Using dictionaries for DataFrame

dataa = {
    "Company":["Toyota", "Camry", "BMW", "Ferrari"],
    "Model":[2019,2020,2005,2009],
    "Class":["New", "New", "Old", "New"]
}

pd.DataFrame(dataa)

   Company  Model Class
0   Toyota   2019   New
1    Camry   2020   New
2      BMW   2005   Old
3  Ferrari   2009   New

In [18]:
#CSV - Comma Separated Values


pd.read_csv("credits.csv")
pd.read_csv("titles.csv")

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
0,ts300399,Five Came Back: The Reference Films,SHOW,This collection includes 12 World War II-era p...,1945,TV-MA,48,['documentation'],['US'],1.0,NaN,NaN,NaN,0.600,NaN
1,tm84618,Taxi Driver,MOVIE,A mentally unstable Vietnam War veteran works ...,1976,R,113,"['crime', 'drama']",['US'],NaN,tt0075314,8.3,795222.0,27.612,8.2
2,tm127384,Monty Python and the Holy Grail,MOVIE,"King Arthur, accompanied by his squire, recrui...",1975,PG,91,"['comedy', 'fantasy']",['GB'],NaN,tt0071853,8.2,530877.0,18.216,7.8
3,tm70993,Life of Brian,MOVIE,"Brian Cohen is an average young Jewish man, bu...",1979,R,94,['comedy'],['GB'],NaN,tt0079470,8.0,392419.0,17.505,7.8
4,tm190788,The Exorcist,MOVIE,12-year-old Regan MacNeil begins to adapt an e...,1973,R,133,['horror'],['US'],NaN,tt0070047,8.1,391942.0,95.337,7.7
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5801,tm1014599,Fine Wine,MOVIE,A beautiful love story that can happen between...,2021,NaN,100,"['romance', 'drama']",['NG'],NaN,tt13857480,6.9,39.0,0.966,NaN
5802,tm1108171,Edis Starlight,MOVIE,Rising star Edis's career journey with ups and...,2021,NaN,74,"['music', 'documentation']",[],NaN,NaN,NaN,NaN,1.036,8.5
5803,tm1045018,Clash,MOVIE,A man from Nigeria returns to his family in Ca...,2021,NaN,88,"['family', 'drama']","['NG', 'CA']",NaN,tt14620732,6.5,32.0,0.709,NaN
5804,tm1098060,Shadow Parties,MOVIE,A family faces destruction in a long-running c...,2021,NaN,116,"['action', 'thriller']",[],NaN,tt10168094,6.2,9.0,2.186,NaN
5805,ts271048,Mighty Little Bheem: Kite Festival,SHOW,"With winter behind them, Bheem and his townspe...",2021,NaN,0,"['family', 'comedy', 'animation']",[],1.0,tt13711094,8.8,16.0,0.979,10.0